CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OnePierOutputInfo Method
 Represents a Pier in the wall stack, for one story. Contains the Design Legs from one or more ETABS PierSectons/WallSections
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OnePierOutputInfo(
	int WallStackIndex,
	int PierIndex,
	ref int StoryID,
	ref string ETABSStoryName,
	ref int NumberDesignLegs
)
Function GetDetailedWall_OneWallStack_OnePierOutputInfo (
	WallStackIndex As Integer,
	PierIndex As Integer,
	ByRef StoryID As Integer,
	ByRef ETABSStoryName As String,
	ByRef NumberDesignLegs As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim PierIndex As Integer
Dim StoryID As Integer
Dim ETABSStoryName As String
Dim NumberDesignLegs As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OnePierOutputInfo(WallStackIndex,
	PierIndex, StoryID, ETABSStoryName,
	NumberDesignLegs)
int GetDetailedWall_OneWallStack_OnePierOutputInfo(
	int WallStackIndex,
	int PierIndex,
	int% StoryID,
	String^% ETABSStoryName,
	int% NumberDesignLegs
)
abstract GetDetailedWall_OneWallStack_OnePierOutputInfo :
        WallStackIndex : int *
        PierIndex : int *
        StoryID : int byref *
        ETABSStoryName : string byref *
        NumberDesignLegs : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
PierIndex
Type: System.Int32
 Pier Output Index
StoryID
Type: System.Int32
 CSiDetail Index of Story on which the pier lies, in the corresponding Tower
ETABSStoryName
Type: System.String
 The Story Name used in ETABS on which the pier lies, in the corresponding Tower
NumberDesignLegs
Type: System.Int32
 Number of Design Legs
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace